const GROUPS = [
  {
    "group": "あ",
    "content": [
      ["あ", "ア", "a"],
      ["い", "イ", "i"],
      ["う", "ウ", "u"],
      ["え", "エ", "e"],
      ["お", "オ", "o"]
    ]
  },
  {
    "group": "か",
    "content": [
      ["か", "カ", "ka"],
      ["き", "キ", "ki"],
      ["く", "ク", "ku"],
      ["け", "ケ", "ke"],
      ["こ", "コ", "ko"]
    ]
  },
  {
    "group": "さ",
    "content": [
      ["さ", "サ", "sa"],
      ["し", "シ", "shi"],
      ["す", "ス", "su"],
      ["せ", "セ", "se"],
      ["そ", "ソ", "so"]
    ]
  },
  {
    "group": "た",
    "content": [
      ["た", "タ", "ta"],
      ["ち", "チ", "chi"],
      ["つ", "ツ", "tsu"],
      ["て", "テ", "te"],
      ["と", "ト", "to"]
    ]
  },
  {
    "group": "な",
    "content": [
      ["な", "ナ", "na"],
      ["に", "ニ", "ni"],
      ["ぬ", "ヌ", "nu"],
      ["ね", "ネ", "ne"],
      ["の", "ノ", "no"]
    ]
  },
  {
    "group": "は",
    "content": [
      ["は", "ハ", "ha"],
      ["ひ", "ヒ", "hi"],
      ["ふ", "フ", "fu"],
      ["へ", "ヘ", "he"],
      ["ほ", "ホ", "ho"]
    ]
  },
  {
    "group": "ま",
    "content": [
      ["ま", "マ", "ma"],
      ["み", "ミ", "mi"],
      ["む", "ム", "mu"],
      ["め", "メ", "me"],
      ["も", "モ", "mo"]
    ]
  },
  {
    "group": "や",
    "content": [
      ["や", "ヤ", "ya"],
      ["ゆ", "ユ", "yu"],
      ["よ", "ヨ", "yo"]
    ]
  },
  {
    "group": "ら",
    "content": [
      ["ら", "ラ", "ra"],
      ["り", "リ", "ri"],
      ["る", "ル", "ru"],
      ["れ", "レ", "re"],
      ["ろ", "ロ", "ro"]
    ]
  },
  {
    "group": "ん",
    "content": [
      ["ん", "ン", "n"]
    ]
  },
]

new Vue({
  el: "#app",

  data: {
    GROUPS,
  },
})
